<a href="https://colab.research.google.com/github/prjanarthanan/Pandas/blob/master/10mins_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Object Creation**

In [91]:
import pandas as pd
import numpy as np

In [92]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [93]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [94]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.939935  0.957250  1.130330  0.273500
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-03 -0.731665 -1.295856  0.525604  0.906104
2013-01-04 -0.001050  0.443810 -0.009740  0.364880
2013-01-05 -0.601750  0.676964 -0.352732  0.079549
2013-01-06  0.027923  0.781728 -1.672597  0.077933

In [95]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [96]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

**Viewing Data**

In [97]:
df.head()

                   A         B         C         D
2013-01-01 -0.939935  0.957250  1.130330  0.273500
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-03 -0.731665 -1.295856  0.525604  0.906104
2013-01-04 -0.001050  0.443810 -0.009740  0.364880
2013-01-05 -0.601750  0.676964 -0.352732  0.079549

In [98]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.001050  0.443810 -0.009740  0.364880
2013-01-05 -0.601750  0.676964 -0.352732  0.079549
2013-01-06  0.027923  0.781728 -1.672597  0.077933

In [99]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [100]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [101]:
df.to_numpy()

array([[-9.39934703e-01,  9.57249818e-01,  1.13032966e+00,
         2.73500201e-01],
       [-6.45819334e-01, -1.95616196e-01, -1.85034946e+00,
        -4.27376643e-01],
       [-7.31665148e-01, -1.29585645e+00,  5.25604284e-01,
         9.06103787e-01],
       [-1.04958374e-03,  4.43809805e-01, -9.74016925e-03,
         3.64880227e-01],
       [-6.01750181e-01,  6.76963854e-01, -3.52731897e-01,
         7.95494657e-02],
       [ 2.79229245e-02,  7.81727553e-01, -1.67259658e+00,
         7.79331000e-02]])

In [102]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [103]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [104]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.482049  0.228046 -0.371581  0.212432
std    0.401135  0.847131  1.189232  0.436636
min   -0.939935 -1.295856 -1.850349 -0.427377
25%   -0.710204 -0.035760 -1.342630  0.078337
50%   -0.623785  0.560387 -0.181236  0.176525
75%   -0.151225  0.755537  0.391768  0.342035
max    0.027923  0.957250  1.130330  0.906104

**Transpose**
*Converting the index as column and column as index*

In [105]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.939935   -0.645819   -0.731665    -0.00105   -0.601750    0.027923
B    0.957250   -0.195616   -1.295856     0.44381    0.676964    0.781728
C    1.130330   -1.850349    0.525604    -0.00974   -0.352732   -1.672597
D    0.273500   -0.427377    0.906104     0.36488    0.079549    0.077933

In [106]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.273500  1.130330  0.957250 -0.939935
2013-01-02 -0.427377 -1.850349 -0.195616 -0.645819
2013-01-03  0.906104  0.525604 -1.295856 -0.731665
2013-01-04  0.364880 -0.009740  0.443810 -0.001050
2013-01-05  0.079549 -0.352732  0.676964 -0.601750
2013-01-06  0.077933 -1.672597  0.781728  0.027923

In [107]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.027923  0.781728 -1.672597  0.077933
2013-01-05 -0.601750  0.676964 -0.352732  0.079549
2013-01-04 -0.001050  0.443810 -0.009740  0.364880
2013-01-03 -0.731665 -1.295856  0.525604  0.906104
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-01 -0.939935  0.957250  1.130330  0.273500

In [108]:
 df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.731665 -1.295856  0.525604  0.906104
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-04 -0.001050  0.443810 -0.009740  0.364880
2013-01-05 -0.601750  0.676964 -0.352732  0.079549
2013-01-06  0.027923  0.781728 -1.672597  0.077933
2013-01-01 -0.939935  0.957250  1.130330  0.273500

 **Selection**

In [109]:
df['A']

2013-01-01   -0.939935
2013-01-02   -0.645819
2013-01-03   -0.731665
2013-01-04   -0.001050
2013-01-05   -0.601750
2013-01-06    0.027923
Freq: D, Name: A, dtype: float64

In [110]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.939935  0.957250  1.130330  0.273500
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-03 -0.731665 -1.295856  0.525604  0.906104

In [111]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-03 -0.731665 -1.295856  0.525604  0.906104
2013-01-04 -0.001050  0.443810 -0.009740  0.364880

**Selection by label**

In [112]:
df.loc['20130102', ['A', 'B']]

A   -0.645819
B   -0.195616
Name: 2013-01-02 00:00:00, dtype: float64

In [113]:
df.loc[dates[0], 'A']

-0.939934703330236

In [114]:
df.at[dates[0], 'A']

-0.939934703330236

In [115]:
df.loc[dates[0]]

A   -0.939935
B    0.957250
C    1.130330
D    0.273500
Name: 2013-01-01 00:00:00, dtype: float64

In [116]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.645819 -0.195616
2013-01-03 -0.731665 -1.295856
2013-01-04 -0.001050  0.443810

**Selection by position**

In [117]:
df.iloc[3]

A   -0.00105
B    0.44381
C   -0.00974
D    0.36488
Name: 2013-01-04 00:00:00, dtype: float64

In [118]:
df.iloc[3:5, 0:2]

                  A         B
2013-01-04 -0.00105  0.443810
2013-01-05 -0.60175  0.676964

In [119]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.645819 -1.850349
2013-01-03 -0.731665  0.525604
2013-01-05 -0.601750 -0.352732

In [120]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377
2013-01-03 -0.731665 -1.295856  0.525604  0.906104

In [121]:
df.iloc[1, 1]

-0.195616195825828

In [122]:
df.iat[1, 1]

-0.195616195825828

**Boolean indexing**

In [123]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-06  0.027923  0.781728 -1.672597  0.077933

In [124]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.957250  1.130330  0.273500
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN       NaN  0.525604  0.906104
2013-01-04       NaN  0.443810       NaN  0.364880
2013-01-05       NaN  0.676964       NaN  0.079549
2013-01-06  0.027923  0.781728       NaN  0.077933

In [125]:
a = df > 0
a

                A      B      C      D
2013-01-01  False   True   True   True
2013-01-02  False  False  False  False
2013-01-03  False  False   True   True
2013-01-04  False   True  False   True
2013-01-05  False   True  False   True
2013-01-06   True   True  False   True

In [126]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01 -0.939935  0.957250  1.130330  0.273500    one
2013-01-02 -0.645819 -0.195616 -1.850349 -0.427377    one
2013-01-03 -0.731665 -1.295856  0.525604  0.906104    two
2013-01-04 -0.001050  0.443810 -0.009740  0.364880  three
2013-01-05 -0.601750  0.676964 -0.352732  0.079549   four
2013-01-06  0.027923  0.781728 -1.672597  0.077933  three

In [127]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.731665 -1.295856  0.525604  0.906104   two
2013-01-05 -0.601750  0.676964 -0.352732  0.079549  four

**Setting a new column automatically aligns the data by the indexes**

In [128]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], 
               index=pd.date_range('20130102', periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [129]:
df.at[dates[0], 'A'] = 0

In [130]:
df.iat[0, 1] = 0

In [131]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [132]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.130330  5
2013-01-02 -0.645819 -0.195616 -1.850349  5
2013-01-03 -0.731665 -1.295856  0.525604  5
2013-01-04 -0.001050  0.443810 -0.009740  5
2013-01-05 -0.601750  0.676964 -0.352732  5
2013-01-06  0.027923  0.781728 -1.672597  5

In [133]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.130330 -5
2013-01-02 -0.645819 -0.195616 -1.850349 -5
2013-01-03 -0.731665 -1.295856 -0.525604 -5
2013-01-04 -0.001050 -0.443810 -0.009740 -5
2013-01-05 -0.601750 -0.676964 -0.352732 -5
2013-01-06 -0.027923 -0.781728 -1.672597 -5

**Missing data**

In [134]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1

df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.130330  5  1.0
2013-01-02 -0.645819 -0.195616 -1.850349  5  1.0
2013-01-03 -0.731665 -1.295856  0.525604  5  NaN
2013-01-04 -0.001050  0.443810 -0.009740  5  NaN

In [135]:
df1['F'] = [np.nan,1.,2.,3.]

In [136]:
df1

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.130330  5  1.0  NaN
2013-01-02 -0.645819 -0.195616 -1.850349  5  1.0  1.0
2013-01-03 -0.731665 -1.295856  0.525604  5  NaN  2.0
2013-01-04 -0.001050  0.443810 -0.009740  5  NaN  3.0

**To drop any rows that have missing data.**

In [137]:
df1.dropna(how='any')

                   A         B         C  D    E    F
2013-01-02 -0.645819 -0.195616 -1.850349  5  1.0  1.0

In [138]:
df1.fillna(value=5)

                   A         B         C  D    E    F
2013-01-01  0.000000  0.000000  1.130330  5  1.0  5.0
2013-01-02 -0.645819 -0.195616 -1.850349  5  1.0  1.0
2013-01-03 -0.731665 -1.295856  0.525604  5  5.0  2.0
2013-01-04 -0.001050  0.443810 -0.009740  5  5.0  3.0

In [139]:
pd.isna(df1)

                A      B      C      D      E      F
2013-01-01  False  False  False  False  False   True
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False   True  False
2013-01-04  False  False  False  False   True  False

**Operations**

In [140]:
df.mean()

A   -0.325394
B    0.068505
C   -0.371581
D    5.000000
dtype: float64

In [141]:
df.mean(1)

2013-01-01    1.532582
2013-01-02    0.577054
2013-01-03    0.874521
2013-01-04    1.358255
2013-01-05    1.180620
2013-01-06    1.034263
Freq: D, dtype: float64

In [142]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [143]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [144]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.731665 -2.295856 -0.474396  4.0
2013-01-04 -3.001050 -2.556190 -3.009740  2.0
2013-01-05 -5.601750 -4.323036 -5.352732  0.0
2013-01-06       NaN       NaN       NaN  NaN


**Apply**

In [145]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  1.130330   5
2013-01-02 -0.645819 -0.195616 -0.720020  10
2013-01-03 -1.377484 -1.491473 -0.194416  15
2013-01-04 -1.378534 -1.047663 -0.204156  20
2013-01-05 -1.980284 -0.370699 -0.556888  25
2013-01-06 -1.952361  0.411029 -2.229484  30

In [146]:
df.apply(lambda x: x.max() - x.min())

A    0.759588
B    2.077584
C    2.980679
D    0.000000
dtype: float64

**Histogramming**

In [147]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    5
1    6
2    1
3    5
4    3
5    2
6    3
7    1
8    0
9    3
dtype: int64

In [148]:
s.value_counts()

3    3
5    2
1    2
6    1
2    1
0    1
dtype: int64

**String Methods**

In [149]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca',
               np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

**Merge**

In [150]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.093423  0.304455  1.224817 -1.430380
1 -0.503040 -0.597152  0.462304 -0.506724
2 -0.404876 -2.035507  0.053185  0.366157
3  0.857892 -2.725545  1.304442  0.293377
4  0.419235 -0.978574  0.251212  0.293810
5  1.944866  0.847333  0.506642 -0.205133
6  1.103886 -0.302474  0.252316  0.437895
7 -1.073370  1.115911  0.656234  0.687847
8 -0.424002 -0.995625  0.101244  1.080554
9  0.968669 -1.516183  0.517147  0.122193

In [151]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.093423  0.304455  1.224817 -1.430380
 1 -0.503040 -0.597152  0.462304 -0.506724
 2 -0.404876 -2.035507  0.053185  0.366157,
           0         1         2         3
 3  0.857892 -2.725545  1.304442  0.293377
 4  0.419235 -0.978574  0.251212  0.293810
 5  1.944866  0.847333  0.506642 -0.205133
 6  1.103886 -0.302474  0.252316  0.437895,
           0         1         2         3
 7 -1.073370  1.115911  0.656234  0.687847
 8 -0.424002 -0.995625  0.101244  1.080554
 9  0.968669 -1.516183  0.517147  0.122193]

In [152]:
pd.concat(pieces)

          0         1         2         3
0  1.093423  0.304455  1.224817 -1.430380
1 -0.503040 -0.597152  0.462304 -0.506724
2 -0.404876 -2.035507  0.053185  0.366157
3  0.857892 -2.725545  1.304442  0.293377
4  0.419235 -0.978574  0.251212  0.293810
5  1.944866  0.847333  0.506642 -0.205133
6  1.103886 -0.302474  0.252316  0.437895
7 -1.073370  1.115911  0.656234  0.687847
8 -0.424002 -0.995625  0.101244  1.080554
9  0.968669 -1.516183  0.517147  0.122193

**Join**

In [153]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [154]:
left

   key  lval
0  foo     1
1  foo     2

In [155]:
right

   key  rval
0  foo     4
1  foo     5

In [156]:
pd.merge(left,right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [157]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [158]:
left

   key  lval
0  foo     1
1  bar     2

In [159]:
right

   key  rval
0  foo     4
1  bar     5

In [160]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

**Grouping**

In [161]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                        'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.772654  0.056667
1  bar    one -0.508122  1.097488
2  foo    two  0.888810 -0.051083
3  bar  three -0.413029 -0.687345
4  foo    two  0.516125  0.061833
5  bar    two -1.342743 -0.277215
6  foo    one -1.309315 -0.891206
7  foo  three  0.387331  0.889791

In [162]:
df.groupby('A').sum()

            C         D
A
bar -2.263894  0.132927
foo  1.255605  0.066002

In [163]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.508122  1.097488
    three -0.413029 -0.687345
    two   -1.342743 -0.277215
foo one   -0.536661 -0.834539
    three  0.387331  0.889791
    two    1.404935  0.010750

**Reshaping**

In [164]:
 tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))
 index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [165]:
 df = pd.DataFrame(np.random.randn(8, 2), 
                   index=index, columns=['A', 'B'])
 df2 = df[:4]
 df2

                     A         B
first second
bar   one     0.019177 -0.233965
      two     0.475163 -1.257931
baz   one     1.605935  0.216330
      two     0.948676  0.110978

In [166]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.019177
               B   -0.233965
       two     A    0.475163
               B   -1.257931
baz    one     A    1.605935
               B    0.216330
       two     A    0.948676
               B    0.110978
dtype: float64

In [167]:
stacked.unstack()

                     A         B
first second
bar   one     0.019177 -0.233965
      two     0.475163 -1.257931
baz   one     1.605935  0.216330
      two     0.948676  0.110978

In [168]:
stacked.unstack(1)

second        one       two
first
bar   A  0.019177  0.475163
      B -0.233965 -1.257931
baz   A  1.605935  0.948676
      B  0.216330  0.110978

**Pivot tables**

In [169]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.463405  2.369400
1     one  B  foo  0.867824 -0.240050
2     two  C  foo  0.158163 -0.646952
3   three  A  bar  1.080312 -1.620104
4     one  B  bar -0.020957 -0.627521
5     one  C  bar  0.472780  0.058366
6     two  A  foo -1.464437  1.531946
7   three  B  foo  0.522241 -0.751590
8     one  C  foo -0.984344 -0.815583
9     one  A  bar -1.523009 -0.176573
10    two  B  bar -0.278904 -0.126705
11  three  C  bar -0.399474 -0.611623

In [170]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.523009 -0.463405
      B -0.020957  0.867824
      C  0.472780 -0.984344
three A  1.080312       NaN
      B       NaN  0.522241
      C -0.399474       NaN
two   A       NaN -1.464437
      B -0.278904       NaN
      C       NaN  0.158163

**Time series**

In [175]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min').sum()

2012-01-01    24746
Freq: 5T, dtype: int64

In [172]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.332316
2012-03-07    0.226235
2012-03-08   -0.114430
2012-03-09    0.230606
2012-03-10    0.661466
Freq: D, dtype: float64

In [176]:
ts_utc = ts.tz_localize('UTC')

ts_utc

2012-01-01 00:00:00+00:00    431
2012-01-01 00:00:01+00:00     78
2012-01-01 00:00:02+00:00    114
2012-01-01 00:00:03+00:00    218
2012-01-01 00:00:04+00:00    486
                            ...
2012-01-01 00:01:35+00:00    370
2012-01-01 00:01:36+00:00    421
2012-01-01 00:01:37+00:00    177
2012-01-01 00:01:38+00:00    114
2012-01-01 00:01:39+00:00      6
Freq: S, Length: 100, dtype: int64

In [177]:
ts_utc.tz_convert('US/Eastern')

2011-12-31 19:00:00-05:00    431
2011-12-31 19:00:01-05:00     78
2011-12-31 19:00:02-05:00    114
2011-12-31 19:00:03-05:00    218
2011-12-31 19:00:04-05:00    486
                            ...
2011-12-31 19:01:35-05:00    370
2011-12-31 19:01:36-05:00    421
2011-12-31 19:01:37-05:00    177
2011-12-31 19:01:38-05:00    114
2011-12-31 19:01:39-05:00      6
Freq: S, Length: 100, dtype: int64

In [178]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.177316
2012-02-29   -1.764338
2012-03-31    2.038397
2012-04-30    0.086886
2012-05-31    1.284986
Freq: M, dtype: float64

In [179]:
ps = ts.to_period()
ps

2012-01    0.177316
2012-02   -1.764338
2012-03    2.038397
2012-04    0.086886
2012-05    1.284986
Freq: M, dtype: float64

In [180]:
ps.to_timestamp()

2012-01-01    0.177316
2012-02-01   -1.764338
2012-03-01    2.038397
2012-04-01    0.086886
2012-05-01    1.284986
Freq: MS, dtype: float64